Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Metro Hunter.tmx
Source language: ko_kr
Languages: en_us

source: 아무리 그래도 10년은 좀···.
en_us: still, ten years is a bit much...

source: 뭐가 그렇게 웃기지?
en_us: what’s so funny?

source: 하지만 당신이 길드에 위협이 되지 않을 존재라는 건 잘 알겠습니다.
en_us: but I can see that you are not a threat to the guild...

source: 적당히 매너 있게 죽고 죽이던 서쪽 마계가
en_us: we used to show common courtesy while killing each other in the west...

source: 퍼{j}어
en_us: kaboom{j}

source: 이번엔 도움을 주다니.
en_us: ...and now you’re helping us.

source: 지잉
en_us: Vshhh

source: 시원하게 쏟아지는군.
en_us: it’s really coming down.

source: 한 발짝만 더 움직여봐.
en_us: just try and take one more step...

source: 아저씨다워서 이상하진 않아요!
en_us: that’s just like you, mister. so it’s fine!

source: 우선 시작은 나!
en_us: I’m up first!

source: 폴짝
en_us: jump

source: 당신께 바칩니다!
en_us: ...and offer them to thee!

source: 키메라를 완성하는데 얼마나 많은 돈이 들었는지 알기나 해?
en_us: do you even know how much money it cost to complete the chimera?

source: 더럽게 뜨겁네!
en_us: that’s freaking hot!

source: 천 평?
en_us: 30 thousand square feet?

source: 우 우
en_us: {j}swoosh

source: 지루한 공격이네?
en_us: that’s one boring attack.

source: 캬아아악!!
en_us: graaah!!

source: 55화
en_us: episode 55

source: 검 마다 능력도 강도도 제각각이라 똑같은 물건이 하나도 없지!
en_us: ...which means no two blades are alike since each has its own strength and abilities!

source: 지금부터 우리는 ꞏꞏꞏ.
en_us: we’re going to...

source: 이것이
en_us: this...

source: 자기 과시?
en_us: are you showing off?

source: 시험해 주마.
en_us: I’ll give you a whirl...

source: 미안하다!{j}아자토스 주니어!
en_us: sorry, azatos junior!

source: 스킬
en_us: skill

source: 파 앗
en_us: sploosh

source: 이 모든 불안한 감정들을 한테 모아.
en_us: I gather all of these unstable emotions...

source: 저승에서 돌아온 기분이 어때?
en_us: how does it feel, coming back from death’s door?

source: 설마 만나자마자 던전으로 가는 거예요?
en_us: are we really going into a dungeon even though we just met up?

source: 콰{j}콰
en_us: kaboom

source: 대체 뭐냐 네놈들은?
en_us: what are you lot exactly?

source: 이전 축복자는 주인의 능력을 소실해 버렸거든.
en_us: the last one lost their master's power.

source: 살다 살다 당신 같은 헌터는 처음입니다.
en_us: truly, I have never met a hunter quite like you.

source: 주인과 축복자는 강한 유대로 이어져 있으니까.
en_us: Masters and servants are connected by a strong bond.

source: 훈련이 불가능한 개체입니다.
en_us: ...which makes them impossible to train.

source: 쪼륵
en_us: glug glug

source: 공허에 삼켜져, 떠돌이 신세가 될 뿐일 테니까!
en_us: you’ll just be swallowed up by the void and end up stuck here forever!

source: 펄럭
en_us: flutter

source: 어으으···.
en_us: uhhh...

source: 마나 말고 더 좋은 게 있어서 괜찮아.
en_us: that’s fine. he’s got something better than mana.

source: 지금은 초월을 유지하는 것조차 힘이 들어.
en_us: but right now, it’s taking all I have just to maintain transcendence.

source: 그보다 무슨 일로 찾아온 거냐?
en_us: anyway, what brings you here?

source: 파앙
en_us: whish

source: 파도의 주인이시여!
en_us: ...master of waves!

source: 날 불러내느라 생명을 빼앗겨 마나 쇼크에 빠졌지.
en_us: their lives were stolen from them to summon me, leaving them in mana shock.

source: 풍덩
en_us: splash

source: 그렇게 덜덜 떨면서 말할 거면서
en_us: if you were going to shake in fear like this...

source: 직
en_us: crush

source: 위반 지점
en_us: (No) Parking () Branch

source: 54화
en_us: episode 54

source: 네가 지페리 같은 녀석과 계약한 게 맘에 들지 않긴 하지만ꞏꞏꞏ.
en_us: I don’t like that you made a contract with someone like zipherie...

source: 스틸 울프즈
en_us: steel wolves

source: 슈아 악
en_us: whoosh

source: 생긴 건 딱 격투가 계열인데···.
en_us: he looks like he would be specialized in hand-to-hand combat...

source: 킥
en_us: snicker

source: 그건 말뿐만인 계약이 아니야.
en_us: that wasn’t just words.

source: 쉐도우 볼
en_us: shadow ball

source: 부우
en_us: vroom

source: 크아아!
en_us: grahhh!

source: 도축하는 과정까지 꼭 알아야 하느냔 말입니다.
en_us: ...really have to know what goes on in a slaughterhouse?

source: 마검
en_us: demon blade

source: 덕분에 그 팔에도 효능이 어느 정도 남아있지.
en_us: that’s why that arm has some of the eye’s power left in it.

source: 이런 고급 속박 스킬을 사용할 수 있다니!
en_us: who would’ve thought he could use such a high-level restraint skill?!

source: 크륵!
en_us: grr!

source: 명분 없는 전쟁을 벌려 동족들의 시체를 늘리지 말거라.
en_us: ...do not let more demons die in unjustified wars.

source: 내가 사지.
en_us: I’ll buy it.

source: 마계의 절반을 장악했다는?
en_us: the one who’s conquered half of the demon realm?

source: 감히 신을 능멸하려 들다니!
en_us: how dare you look down on god!

source: 지페리 님은···.
en_us: ms. zipherie...

source: 우리는 골드 등급에 인원도 셋이다.
en_us: we’re gold and there’s three of us.

source: 그런데 왜 듣도 보도 못한 너 따위 놈한테 당해야 하는 건데?
en_us: so how did it lose to a nobody like you?

source: 곽진성이 보내서 왔나 보지?
en_us: I’m guessing jinseong gwak sent you?

source: 너의 힘과 나의 길드 경영능력!
en_us: your power and my guild’s finances!

source: 내일
en_us: tomorrow

source: 저희 왠지 한발 늦은 것 같네요.
en_us: we’re one step too late, it seems.

source: 이 ㅅ끼!!
en_us: you son of a b*tch!!

source: 조사를 의뢰해 볼까요?
en_us: shall I hire someone to investigate?

source: 푸
en_us: flap

source: 드르륵
en_us: roll

source: 머리가 자란다고?!!!!
en_us: it’s growing hair?!

source: 캬악!!
en_us: grah!!

source: 하루종일
en_us: all-day

source: 시크릿 수분크림
en_us: secret moisturizer

source: 잘 부탁드립니다!
en_us: sir!

source: 인간이 주인을 죽인다?
en_us: a human killing a master?

source: 웬만한 수준의 헌터가 아니면 찾아오기도 벅찰껄?
en_us: even getting here is probably beyond all but the best hunters.

source: 그리고ꞏꞏꞏ.
en_us: and...

source: 열차에 탈 자격을 박탈당했거든.
en_us: ...which means I’ve lost the right to board the train.

source: 마계행 열차 기장 보르도
en_us: demon realm train conductor bordo

source: 좀 쓸만한 건 없어요?
en_us: don’t you have something more useful?

source: 흡!!
en_us: argh!!

source: 아니?
en_us: what?

source: 쿤.{j}나의 주인.{j}마계의 왕이시여.
en_us: khun, my master, king of the demon realm.

source: ㅅ발!
en_us: f*ck!

source: 기사단장 함필규를 임시 마스터로 임명했다.
en_us: ...the guild quickly appointed the knight commander pilgyu ham as its temporary guild master.

source: 말해!
en_us: say it!

source: 6호선
en_us: line 6

source: 맞습니다.
en_us: correct.

source: 그러지 않았다.
en_us: ...but he didn’t.

source: 잽.
en_us: Jab.

source: 제가 만들고 있는 건 파도의 주인의 정신을 담을 그릇입니다.
en_us: I am creating a vessel to contain the Master of Waves’s consciousness.

source: 젠장···.
en_us: dammit...

source: 도움받은 건 우리인데
en_us: why are you the one who’s hurt...

source: 마족이 아니면 말을 듣지 않는 녀석인데?
en_us: it’s only ever listened to demons.

source: 네놈!!
en_us: you!!

source: 으아아ꞏꞏꞏ.
en_us: aaah...

source: 비겁하게 둘이서 하나를 상대할 셈이냐?
en_us: are you going to fight me two against one, like a bunch of cowards?

source: 다인 슬라이프?
en_us: dain sleif?

source: 콰{j}쾅
en_us: kaboom

source: 보그르륵
en_us: burble

source: 어쩐지 주변을 밝게 만드는 좋은 기운이 느껴지는 구만.
en_us: you really have a way of lighting up the room.

source: 파도의 주인을.
en_us: the Master of Waves.

source: 설마 죽은건 아니겠지?
en_us: he can’t be dead, right?

source: 휘릭
en_us: whirl

source: 그대로 쓰러져 있어줬으면 좋겠는데···.
en_us: it would be great if they were knocked out...

source: 콰 콰 콰 콰
en_us: roar

source: 큭큭큭
en_us: kekeke

source: 견디지 못하는 법이지!
en_us: ...a cowardly fight!

source: 확
en_us: leap

source: 배신이 아니야!
en_us: I didn’t betray you!

source: 키
en_us: fwoom

source: 부활을 축하드립니다.
en_us: congratulations on your revival...

source: 아까워라!
en_us: what a shame!

source: 물방울의 길드 마스터 교주 김택.
en_us: The guild master and elder of the Waterdrop Guild, Taek Kim...

source: 치익
en_us: screee

source: 하하하하하하!!!
en_us: wahahahaha!!!

source: 쓸만한 거라아~ 하아~
en_us: something useful, you saaay? hmmm.

source: 역시 가짜는 진짜를 넘을 수 없는 건가?
en_us: I guess a fake’s no match for the real deal after all.

source: 직행 불광 마계
en_us: non-stop bulgwang demon realm

source: 아깝군, 조금만 더 훔쳐 오고 싶었는데
en_us: too bad, I wanted to steal some more.

source: 자연스러운 감정이여!
en_us: ...is a normal thing teh feel!

source: 어디가지 일지!!
en_us: ...the limits of my power!!!

source: 네 녀석이 검에 붙어있었지.
en_us: you were stuck to his sword.

source: 덕분에 최상급 마나 스톤도 손에 넣었으니.
en_us: ...since you helped us get our hands on these highest grade stones.

source: 균형이 무너진다!
en_us: I’m losing my balance!

source: 치이이익
en_us: fshhh

source: 웨폰마스터
en_us: weaponmaster

source: 흥.
en_us: hmph.

source: 남김없이 뽑아내주마!
en_us: I’ll extract every last drop!

source: 부탁?
en_us: a favor?

source: 뭐냐?!
en_us: what is it?!

source: 144억 5천 2백 33만 2천 5백 원
en_us: 14,452,332,500 won*...

source: 처음은 화려했지만.
en_us: you were always a flashy one.

source: 45화
en_us: episode 45

source: 탈 탈
en_us: shake shake

source: 내가 이겼다.
en_us: I won.

source: 직접 보여줄 테니 잘 보시라구.
en_us: I’ll show you, so keep your eyes peeled.

source: 넌 밤 구름의 비지니스를 몇 번이나 망쳐놨어.
en_us: you’ve messed up night cloud’s dealings more than once.

source: 마스터는 널 생포해오라고 하셨지만···.
en_us: my master told me to capture yeh alive...

source: 가능하면···.
en_us: if you can...

source: 마법사
en_us: mage

source: 투
en_us: whoosh

source: 예!
en_us: yes,

source: 오랜만이군 보르도.
en_us: long time no see, bordo.

source: 구룡 길드.
en_us: the nine dragons guild.

source: 잘각
en_us: clatter

source: 슈루륵
en_us: swoosh

source: 가까이 오지 마!
en_us: don’t come any closer!

source: 한시름 놓았군!
en_us: that’s a relief!

source: 환이 일행이 위험하다!
en_us: hwan and the others are in danger!

source: 자ꞏꞏꞏ 잘못했어!!
en_us: I-I’m sorry!

source: 정말 강철 님을 해칠 생각인가요?
en_us: are you really going to kill mr. kang?

source: 감이 좋은 편이구나?
en_us: you’ve got pretty sharp senses, don’t you?

source: 그렇다면ꞏꞏꞏ.
en_us: then...

source: 일전에 봤던 그 친구인가?
en_us: was it that fellow from before?

source: 이제부터 알아서 하도록 해.
en_us: find your own way from here on.

source: 더 이상 동족이 피 흘리며 싸우는 걸 지켜볼 순 없다.
en_us: I will no longer stand by while my fellow demons shed their blood.

source: 길드는 앞으로 네가 관리해.
en_us: you’re in charge of the guild from now on.

source: 이 이상 넘어가면 서쪽 마계.
en_us: any farther than this, and it’s the western demon realm.

source: 부들
en_us: shake

source: 파하하
en_us: ahaha

source: 거기가 어딘데요?
en_us: where is that?

source: 단장님이 추천해 준 인재라면 만나 볼 가치가 있는 사람이겠지요?
en_us: if the Knight Commander himself is recommending them, they must be special indeed.

source: 인간들이 죽는다고 얻을 수 있는 것도 없고ꞏꞏꞏ.
en_us: ...and there’s nothing to be gained from humans dying...

source: 도우러 왔습니다!
en_us: I came to help!

source: 곤란해 보이는데 제가 도움을 좀 드릴까요?
en_us: you seem to be in a tight spot. would you like a hand?

source: 이ꞏꞏꞏ익!
en_us: e-eek...!

source: 저는 마족이 아닙니다.
en_us: I am not a demon.

source: 기세를 몰아서
en_us: I’ll gather my strength...

source: 넌 왜 올라왔어?!
en_us: why did you come up?!

source: 마나를 역류시켜놨거든.
en_us: it’s because I put their mana in reverse.

source: 1300억 원이라는 막대한 자금을 쏟아부어 실행한 프로젝트.
en_us: ...and the huge sum of 130 billion won* to carry out this project.

source: 비처럼 쏟아지는 천 개의 창.
en_us: A thousand spears that fall like rain.

source: 이 몸뚱아리 뿐이었으니까요!
en_us: ...was this body!

source: 나 쁜 여 사
en_us: a bad missus

source: 동작이 큰 오크의 공격을 간파하여
en_us: read the attacks of an orc who makes big movements...

source: 그렇다면 한 자리 더 부탁드려도 되겠습니까?
en_us: then may I request an extra seat at the table?

source: 가만히
en_us: did you really think...

source: 상대 본진에 들어와서 길드 마스터를 협박하다니···.
en_us: you come into the enemy’s headquarters and threaten their guild master...?

source: 슬픔과 외로움.
en_us: sorrow and loneliness.

source: 비고!!!!
en_us: veego!!!!

source: 네놈은?!
en_us: you!

source: 그건 아니야.
en_us: no.

source: 대화로 풀어보려 했는데···.
en_us: I thought we could talk it over...

source: 무기를 버렸어?
en_us: he threw his weapon away?

source: 퍼 억
en_us: {j}thwack

source: 오래간만이구나.
en_us: long time no see.

source: 파도의 주인의
en_us: the Master of Waves...

source: 부스럭
en_us: rustle

source: 파도의 주인의 완전한 부활입니다.
en_us: the Master of Waves is completely revived!

source: 네!
en_us: yes!

source: 우리는ꞏꞏꞏ.
en_us: we are...

source: 싸운다.
en_us: we’re going to fight.

source: 뭐지?
en_us: what is it?

source: 네가 부순 건데 좀 도와줘.
en_us: you broke it, so help us out here.

source: 마스터!!
en_us: master!

source: 이딴 곳에 날 가둘 수 있을 거라 생각해?!
en_us: you think you can trap me in a place like this?!

source: 살려만 주시면 제가 설득해 볼게요!
en_us: if you just let her live, then I’ll try convincing her!

source: 던전과는 느껴지는 마나의 양과 질이 달라요!
en_us: the amount and quality of the mana is on a different level from dungeons!

source: 가지가지 하는군.
en_us: this is getting annoying.

source: 이거 얼마예요?
en_us: how much is it?

source: 나를?
en_us: me?

source: 내 목적은 단 하나!
en_us: I only have one goal!

source: 장난치지 말고 제일 좋은 걸로 보여줘.
en_us: stop messing around and show us the best you have.

source: 던전도 인간계도 아닌 또 다른 공간.
en_us: there’s a place that is neither part of the human world nor a dungeon.

source: 여러분 가시는 모든 길에 도움 되는
en_us: wherever you're headed,

source: 안녕하십니까.
en_us: hello...

source: 강남역 사태 때 생존자가 없다고 했지만
en_us: they said there were no survivors of the gangnam station incident...

source: 53화
en_us: episode 53

source: 오늘도 우리 열차 이용해 주시는 승객 여러분 감사합니다.
en_us: greetings, passengers. thank you for boarding our train today.

source: 그리고 노량진 오크 사건에 물방울 길드까지.
en_us: the noryangjin orc incident, and the thing with the waterdrop guild.

source: 밤 구름 길드는 와일드한 곳이지.
en_us: the night cloud guild is a wild place.

source: 샥
en_us: whish

source: 됐어, 됐어!
en_us: fine, fine!

source: 정말요?!
en_us: really?!

source: 특급 열차에 오르실 여러분을 환영합니다!
en_us: welcome aboard our superfast high-speed train!

source: 므아아아!!
en_us: grahhh!!

source: 나는 시간의 속박에서 자유로우니까!
en_us: ...since I’m not bound by time!

source: 할 거 같냐?
en_us: what makes you think I would?

source: 알다가도 모르겠군요.
en_us: just when you think you know someone...

source: 재밌네?
en_us: it is.

source: 왔군.
en_us: you’re here.

source: 그때까지 강철 네놈이 살아있다면!
en_us: if you’re still alive by then, cheol kang...!

source: 키이익
en_us: screee!

source: 아니.{j}소용없어.
en_us: no. there’s no point.

source: 너에게선 분노와 살의
en_us: I don’t feel anger or killing intent...

source: 네 능력은 강철 님에게 언젠가 큰 도움이 될 거다.
en_us: ...but someday, your ability will be of great help to mr. kang.

source: 파아
en_us: crackle

source: 그런데 사람이 둘인데 막걸리는 왜 한 병뿐이야?
en_us: but there’s two of us, so why is there only one bottle?

source: 저지른 거야?
en_us: ...do something so ballsy?

source: 왈칵
en_us: fwish

source: 전사가
en_us: a warrior’s...

source: 올드원이 된 쿤의 오른팔이었다.
en_us: ...the right hand of khun, who had become the old one.

source: 절대 아닙니다.
en_us: definitely not.

source: 우릴 얕보고 있는 건 확실하다.
en_us: ...but he has to be looking down on us.

source: 이렇게 위험한 곳에 마계의 입구가 있다니.
en_us: who would’ve thought the entrance to the demon realm would be in such a dangerous place?

source: 지페리의 궁전
en_us: zipherie’s palace

source: 게다가 이 못들···.
en_us: and these spikes...

source: 아···.
en_us: oh...

source: 전설의 용사가 하는 장난치곤 너무 저급한 거 아니냐?!
en_us: isn’t that joke a bit lowbrow for a legendary warrior like yourself?!

source: 서열 정리를 했다는 게, 직접 하셨다는 뜻이었군요ꞏꞏꞏ.
en_us: so the one who established the pecking order... was him...

source: 다인 슬라이프!!
en_us: dain sleif!!

source: 전리품도 없이 상처만 남았던 전투였지만,
en_us: the only thing cheol kang had gotten out of the fight was injuries...

source: 앞으로는 시키는 대로 할 테니까 제발 풀어줘!!!
en_us: I’ll do everything you tell me to from now on, so please let me go!!!

source: 당신은 대체 얼마나 거친 삶을 살아온 게요.
en_us: what kind of brutal life have you led?

source: ···아닙니다.
en_us: no, sir...

source: 이 눈을 잃은 그날도 비가 왔었거든.
en_us: it was raining the day I lost this eye too.

source: 열차가 이 지경이 돼버려서.
en_us: look at the state of the train.

source: 아아아아!!
en_us: aaah!

source: 고오
en_us: gurgle

source: 누가 또 있나요?
en_us: is there someone else?

source: 알아서 사정거리 안에 들어와주다니!
en_us: thanks for walking right into my attack range!

source: 지금 스승님은 누구보다 강하죠?
en_us: master, you’re stronger than anyone right now, aren’t you?

source: 마계의 절반을 지배하고 있는 정복자 쿠가.
en_us: ...the conqueror kuga, who rules half of the demon realm.

source: 더 이상 당신을 따르지 않겠다.
en_us: ...will no longer serve you.

source: 마침 나도 궁금한 게 있었는데 잘 됐어.
en_us: but this is good. there’s something I’ve been curious about, too.

source: 키에엑!
en_us: krahh

source: 노력해보마.
en_us: I’ll try.

source: 여기저기 소문도 좀 내주고!
en_us: what happened here today!

source: 전설은 무슨ꞏꞏꞏ 그냥 은퇴한 늙은이지 뭐!
en_us: legendary, my foot... I’m just a retired geezer!

source: 교주를 만나러 왔소.
en_us: I’m here to see the elder.

source: 바로 발견!
en_us: and right away, we see one!

source: 부왕
en_us: fwoom

source: 이 끝없는 깊이.
en_us: it’s bottomless.

source: 이런···.
en_us: oh dear...

source: 에이, 설마!
en_us: nah!

source: 굴복하고 굴복시켜서
en_us: yeh surrender teh it and make it surrender teh yeh.

source: 오크들을 나약하게 만든 장본인이?
en_us: yer the one who made the orcs weak?

source: 하지만 이다음은 어쩔 거지?
en_us: but what were you planning to do after this?

source: 우왔!!
en_us: ack!!

source: 지금 당장 회수하겠다.
en_us: now.

source: 빈혈이 있어서.
en_us: I’m anemic.

source: 50화
en_us: episode 50

source: 유니크 아이템.
en_us: here’s a unique item.

source: 그녀는 쿤의 순수한 힘을 동경했지.
en_us: she longed for khun’s pure, unadulterated strength.

source: 아직도 살아있다니.
en_us: who knew you were still among the living?

source: 축복자인 저의 소환 의식이 있어야 하지요.
en_us: I must perform the summoning ritual as one of the blessed.

source: 깨어나셨군요!!
en_us: you’re awake!!

source: 너였구만?
en_us: it was yeh?

source: 마계 서열 4위
en_us: demon realm rank 4

source: 장의사가 말해준 알맞은 복용법은 한 번에 한 알.
en_us: the undertaker said to take one tablet at a time.

source: 지금부터 마족들 뚝배기 깨러 갈 생각인데···.
en_us: we were about to go thrash some demons...

source: 마인드 컨트롤
en_us: mind control

source: 제길!!
en_us: dammit!!

source: 초월 상태의 강철이 뿜어내는 천재지변과도 같은 존재감에
en_us: ...while being in a state of transcendence gave him an overpowering presence.

source: 코코가 해골이었어?
en_us: cocos were skulls?

source: 여기서 싸우면 어떡해!
en_us: what are you thinking, fighting in here?!

source: 그리고 짐승왕 비고다!
en_us: and veego the beast king!

source: 얕보지 말어~!!
en_us: don’t yeh look down on me!!

source: 여기는 내 구역이야!
en_us: this is my turf!

source: 비고&레이가 터보 모드!
en_us: veego and rayga turbo mode!

source: 무식한 쿠가 녀석이 통째로 삼켜버렸거든.
en_us: that fool kuga swallowed it whole.

source: 처음엔 손밖에 없었지만,
en_us: At first, all I had were the hands...

source: 불광역에 서식하는 몬스터는?
en_us: what monster inhabits bulgwang station?

source: 갑작스러운 교주 김택의 죽음으로
en_us: with the sudden death of the elder, taek kim...

source: 6호선 이태원역
en_us: line 6 itaewon station

source: 그쪽의 10년은 받아봐야 가치가 없어서 말이야.
en_us: ten years of your life are worthless, see.

source: 철컥
en_us: clack

source: 김은정
en_us: Eunjeong Kim

source: 슈{j}와{j}악
en_us: whoosh

source: 동료였거든.
en_us: ...were comrades.

source: 나 말고 정복자 쿠가에게 있다.
en_us: I don’t, but kuga the conqueror does.

source: 교단의 신도를 늘리고 자신이 교주가 되는데 가장 큰 공헌을 한 김택의 오리지널 스킬.
en_us: Taek Kim’s original skill. Contributed the most to the growth of the order and kim becoming the order’s leader.

source: 으아앗!
en_us: ahhh!

source: 화염의 주인의 종이여.
en_us: tell me, servant of the Master of Flames.

source: 과연 얼마나 강한ꞏꞏꞏ.
en_us: how strong will it be...?

source: 봉구 대장!
en_us: boss!

source: 파도의 주인이 우위였던
en_us: and so, the balance of power began to tip...

source: 키에에에!!
en_us: screee!

source: 깨어나서 다행일세ꞏꞏꞏ.
en_us: I’m glad you’re awake...

source: 번 쩍
en_us: flash

source: 이 자리에서 널 베어버릴지도 모르니까.
en_us: ...I’ll cut you down where you stand.

source: 아ꞏꞏꞏ 안돼!
en_us: n-no!

source: 큭크크큭
en_us: hohohoho.

source: 포션을 흡수하여 넘쳐나는 마나와
en_us: cheol kang’s mana was overflowing due to the potion...

source: 쿠{j}당
en_us: whoosh{j}

source: 웨에엑!
en_us: blegh!

source: 번뜩
en_us: blink

source: 당해줄 것 같냐?
en_us: ...I would just stand and take it?

source: 너 잘난 거 알았으니까, 제발 그 불 좀 꺼 줘!
en_us: you’re amazing. so please, put out that fire!

source: 어쩐지 길을 비켜주는 것 같은데요?
en_us: doesn’t it seem like they’re letting us through?

source: 우웁
en_us: mmph

source: 젋은 헌터들이 알면 다들 까무러칠 거다.
en_us: the younger hunters would faint if they knew.

source: 그렇다면 이것도 한번 피해보시지요!
en_us: then try running from this!

source: 터업
en_us: thwack

source: 이런 미친!!
en_us: what the hell!!

source: 제가 스틸 울프즈의 서열 2위입니다!
en_us: I am the steel wolves’ second-in-command!

source: 하 하 하
en_us: hahaha

source: 현란하게 움직이지만
en_us: they move in a chaotic way...

source: 넌 지페리와 피로 이어진 주종의 맹약을 맺었지?
en_us: you made a master-servant blood pact with zipherie, right?

source: 피닉스의 눈.
en_us: the phoenix eye.

source: 캬 악
en_us: charge

source: 안 그래?
en_us: isn’t that right?

source: 귀신 검.
en_us: the ghostly blade.

source: 슈{j}우{j}우
en_us: whooosh

source: 그렇다면 이건 안 사고 못 배기실 겁니다.
en_us: then you won’t be able to resist buying this.

source: 터
en_us: clang

source: 엿이나 먹으라지!!
en_us: screw you!!

source: 주인에 의해 보호받고,
en_us: it means that you’re under the master’s protection...

source: 철산역
en_us: cheolsan station

source: 약해진 마음에 침투하여 심리를 조작할 수 있다.
en_us: allows the user to invade and plant thoughts into a weak mind.

source: 스킬 아이언 메이든
en_us: Skill Iron Maiden

source: 뻔뻔한 놈!!
en_us: what nerve!

source: '지페리'
en_us: zipherie

source: 하하ꞏꞏꞏ.
en_us: haha...

source: 슈{j}악
en_us: whoosh{j}

source: 다인 슬라프가 깃들어 있나 보군?
en_us: dain sleif’s inside of it, isn’t he?

source: 어째서 네가 인간들 걱정을 하는 거지?
en_us: why do you care about humans?

source: 이 이질적인 마나···.
en_us: this foreign mana...

source: 풀어야 할 원한이 남은 철천지원수.
en_us: ...are mortal enemies with a grudge to settle.

source: 그만해!!
en_us: stop!

source: 네가 지키려하는 지페리에 대해서 말이야.
en_us: about that zipherie you were trying to protect.

source: 크으ꞏꞏꞏ.
en_us: that hits the spot...

source: 텅
en_us: clatter

source: 자네가 이제 물방울을 이끄는 수장이라고.
en_us: you’re the leader of waterdrop now.

source: 그 검으로 날 벨 셈이냐?
en_us: do you plan to cut me down with that sword?

source: 네놈을 짓밟아줄 존재는 따로 있다!
en_us: There’s someone else who’ll crush you for me, asshole!

source: 제물이 된 신도들과 똑같은 말을 하는구나!
en_us: ...you say the same things as the sacrificed believers!

source: 예?
en_us: what?

source: 아이고~ 무서워라~!
en_us: oh no, I’m scared!

source: 57화
en_us: episode 57

source: 드{j}드{j}득
en_us: screeeech

source: 켁!
en_us: hehe

source: 언노운 LEVEL ???
en_us: unknown level ???

source: 그런데···.
en_us: but...

source: 이러면 더 이상 버틸 수가ꞏꞏꞏ.
en_us: I won’t be able to hold out for much longer...

source: 네가 가지고 있는 거냐?
en_us: you have it?

source: 하지만 아자토스 님!
en_us: but sir!

source: 너무 많잖아 이 자식아!
en_us: ...too many, you creep!

source: 조상님이 뭐라고 하시던가요?
en_us: and what’d they say?

source: 딸기 우유에 붉은 색을 내기 위해
en_us: did you know that they use insects called cochineals...

source: 그거라면 문제없어.
en_us: that won’t be a problem.

source: 갑자기 왜 그러십니까?
en_us: what’s gotten into you?

source: 슈{j}확
en_us: swoosh

source: 오크와의 전투는 피해야 하는 걸까?
en_us: ...should you avoid fighting orcs?

source: 등을 보이고 도망치는 겨?
en_us: ...turning tail?

source: 갈매기
en_us: seagull

source: 슉
en_us: swoosh

source: 댐벼!
en_us: bring it on!

source: 형!
en_us: hyeong*!

source: 아 아 앗
en_us: whoosh

source: 아직 덜 맞았나 보군요!
en_us: ...I guess you haven’t had enough yet!

source: 허세 부리지 마!
en_us: don’t bluff!

source: 뻔뻔한 소리를 잘도 하는군.
en_us: you have got some nerve.

source: 단장님.
en_us: welcome!

source: 부활이 얼마 남지 않은 거지?
en_us: ...I assume it will not be long before your master revives, correct?

source: 언젠가 반드시 백 배로 갚겠네!
en_us: ...a hundred-fold!

source: 쥐새끼처럼 잘도 빠져나가는군요?
en_us: you have quite the talent for running away, don’t you? just like a rat.

source: 드디어 뭉칠 수 없던 마계의 파벌들이
en_us: finally, the scattered factions of the demon realm...

source: 콰{j}악
en_us: slash

source: 어디 실컷 도망쳐봐!
en_us: try and escape as much as you want!

source: 내 축복자로 만들고 싶은데, 이미 쿠가랑 계약을 해버려서.
en_us: I wanted to make you into my blessed one, but you’ve already made a contract with kuga.

source: 키에엑!!
en_us: kraaah!!

source: 약속을 지켜라.
en_us: keep your promise.

source: 협회가 개입하면 물방울은 끝이야!
en_us: if the association steps in, waterdrop is done for!

source: 당신 팔 한 쪽, 그 녀석이 가지고 있나 보군.
en_us: ...that he’s got your other arm.

source: 호들갑 떨지 마라.
en_us: stop being so dramatic,

source: 그때 일로 아직도 삐져있는 거냐?
en_us: are you still mad about that?

source: 여기···.
en_us: here...

source: 므우아으···.
en_us: graawr...

source: 아오!
en_us: damn!

source: 당신 같은 먹이라면,
en_us: even the Master of Waves would be pleased...

source: 안녕하···.
en_us: hi--

source: 나의 오랜···.
en_us: ...my old...

source: 아몬을 소환해서 날 저기까지 날려줄 수 있어?
en_us: can you summon amon and have him launch me over there?

source: 황예름
en_us: Yerim Hwang

source: 파직
en_us: crack

source: 이걸 노린겨?
en_us: ...from the beginning?

source: 이 자식!!!
en_us: you little!!!

source: 그럼, 마계 아이템이
en_us: well, duh.

source: 쿤의 계획은
en_us: ...khun’s plan...
